#Задача 1
#Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].
#выведите все элементы, которые меньше 5.
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
print(list(filter(lambda elem: elem < 5, a)))
print([e for e in a if e < 5])

